#include <stdio.h>
// აიმპორტებს ინპუთ/აუთპუთ ბიბლიოთეკას, რისი მეშვეობითაც გამოვიყენებთ ფუნქციებს - printf and scanf.

// პირობა: მოცემულია მთელი ტიპის a=28 ცვლადი. შეადგინეთ პროგრამა, რომელიც კონ-სოლზე გამოიტანს მოცემული ცვლადის მესამედის მთელ და ზუსტ მნიშვნელო-ბებს.

int main()
// main (მთავარ) ფუნქციას განვსაზღვრავთ (ვქმნით)

{
    int a = 28;
    //  დავადეკლარირეთ (შევქმენით) ერთი ცვლადი - a, რომლის მნიშვნელობაც არის 28. a ცვლადის ტიპია - int (ინტეჯერი, integer)

    printf("Res1 = %d \n", a / 3);
    // დავბეჭდეთ მთელი განაყოფი, 9.


    printf("Res2 = %1.2f \n", a / 3.);
    // დავბეჭდეთ ზუსტი განაყოფი 9.33 
}