#include <stdio.h>
// აიმპორტებს ინპუთ/აუთპუთ ბიბლიოთეკას, რისი მეშვეობითაც გამოვიყენებთ ფუნქციებს - printf and scanf.

// პირობა: შეადგინეთ პროგრამა, რომელიც განსაზღვრავს მინიმალური მნიშვნელობის ცვლადს ნებისმიერ ორ ცვლადს შორის.

int main()
// main (მთავარ) ფუნქციას განვსაზღვრავთ (ვქმნით)

{
    int x, y, min;

    //  დავადეკლარირეთ (შევქმენით) 3 ცვლადი, x, y და min, რომლებიც შეინახავენ მომხმარებლის მიერ შემოყვანილ მნიშვნელობებს. მათი ტიპია - int (ინტეჯერი, integer).

    printf("x = ");

    // ვბეჭდავთ "x = ", რადგან მომხმარებელს მიანიშნოს, რომ x ცვლადისთვის შეიყვანოს მნიშვნელობა

    scanf("%d", &x);
    // კითხულობს მომხმარებლის მიერ შემოტანილ მნიშვნელობას და ინახავს x ცვლადში.
    // "%d" scanf ფუნქციას ეუბნება, რომ მნიშნველობა, რაც მომხმარებელმა შეიყვანა, int (ინტეჯერის) ტიპის უნდა იყოს (მაგ: 1, 2, 3, 4, 5....)
    // "&x" წარმოადგენს მეხსიერების მისამართს, სადაც scanf ფუნქცია შეინახავს მომხმარებლის მიერ შეყვანილ მნიშნველობას (მონაცემს)

    printf("y = ");
    // ვბეჭდავთ "y = ", რადგან მომხმარებელს მიანიშნოს, რომ y ცვლადისთვის შეიყვანოს მნიშვნელობა

    scanf("%d", &y);
    // კითხულობს მომხმარებლის მიერ შემოტანილ მნიშვნელობას და ინახავს y ცვლადში.
    // "%d" scanf ფუნქციას ეუბნება, რომ მნიშნველობა, რაც მომხმარებელმა შეიყვანა, int (ინტეჯერის) ტიპის უნდა იყოს (მაგ: 1, 2, 3, 4, 5....)
    // "&y" წარმოადგენს მეხსიერების მისამართს, სადაც scanf ფუნქცია შეინახავს მომხმარებლის მიერ შეყვანილ მნიშნველობას (მონაცემს)

    min = x > y ? y : x;
    // ამ ხაზზე მოცემულია ternary operator (condition ? true_value : false_value)
    // თუ x მეტია y-ზე, ტერნარი ოპერატორი დააბრუნებს y-ს. თუ არა - x.
    // condition ამ შემთხვევაში => x > y.

    printf("minimum number of two = %d\n ", min);
    // ვბეჭდავთ min ცვლადის მნიშნველობას.

    return 0;
    // ასრულებს ფუნქციას და აბრუნებს 0, რაც ნიშნავს, რომ ფუნქცია წარმატებით გაეშვა.
}