#include <stdio.h>
// აიმპორტებს ინპუთ/აუთპუთ ბიბლიოთეკას, რისი მეშვეობითაც გამოვიყენებთ ფუნქციებს - printf and scanf.

// პირობა: შეადგინეთ პროგრამა, რომელიც მთელი ტიპის (ინტეჯერი) ორ ცვლადს შორის მოახდენს მნიშვნელობების გაცვლას დამატებითი ცვლადის შემოტანის გარეშე.

int main()
// main (მთავარ) ფუნქციას განვსაზღვრავთ (ვქმნით)
{
    int a, b;
    //  დავადეკლარირეთ (შევქმენით) 2 ცვლადი, a და b, რომლებიც შეინახავენ მომხმარებლის მიერ შემოყვანილ მნიშვნელობებს. მათი ტიპია - int (ინტეჯერი, integer)

    printf("Before:\n");
    // ვბეჭდავთ "Before:", რასაც მოყვება შემდეგში ახალი ხაზი

    printf("a=");
    // ბეჭდავს "a=", რადგან მომხმარებელს მიანიშნოს, რომ a ცვლადისთვის შეიყვანოს მნიშვნელობა

    scanf("%d", &a);
    // კითხულობს მომხმარებლის მიერ შემოტანილ მნიშვნელობას და ინახავს a ცვლადში.
    // "%d" scanf ფუნქციას ეუბნება, რომ მნიშნველობა, რაც მომხმარებელმა შეიყვანა, int (ინტეჯერის) ტიპის უნდა იყოს (მაგ: 1, 2, 3, 4, 5....)
    // "&a" წარმოადგენს მეხსიერების მისამართს, სადაც scanf ფუნქცია შეინახავს მომხმარებლის მიერ შეყვანილ მნიშნველობას (მონაცემს)

    printf("b=");
    // ბეჭდავს "b=", რადგან მომხმარებელს მიანიშნოს, რომ a ცვლადისთვის შეიყვანოს მნიშვნელობა

    scanf("%d", &b);
    // კითხულობს მომხმარებლის მიერ შემოტანილ მნიშვნელობას და ინახავს b ცვლადში.
    // "%d" scanf ფუნქციას ეუბნება, რომ მნიშნველობა, რაც მომხმარებელმა შეიყვანა, int (ინტეჯერის) ტიპის უნდა იყოს (მაგ: 1, 2, 3, 4, 5....)
    // "&b" წარმოადგენს მეხსიერების მისამართს, სადაც scanf ფუნქცია შეინახავს მომხმარებლის მიერ შეყვანილ მნიშნველობას (მონაცემს)

    a = a + b;
    // უმატებს a-ს მნიშნველობას b-ს მნიშვნელობას და ჯამს ინახავს a ცვლადში.

    b = a - b;
    // აკლებს a-ს მნიშნველობას b-ს მნიშვნელობას და სხვაობას ინახავს b ცვლადში. რადგან თავდაპირველად, a-ს მნიშვნელობა იყო a + b, ეს სხვაობა ინახავს b ცვლადში a ცვლადის თავდაპირველ მნიშვნელობას:
    // b = a - b
    // b = a + b - b (b-ები გაბათილდება, რადგან a = a + b)
    // b = a

    a = a - b;
    // აკლებს a-ს მნიშნველობას b-ს მნიშვნელობას და სხვაობას ინახავს a ცვლადში.
    // a = a - b
    // a = a + b - b (რადგან a მნიშვნელობა a + b-ს უდრის, 29-ე ხაზი)
    // a = a + b - a (რადგან b მნიშვნელობა a-ს უდრის [36-ე ხაზი], a-ები გაბათილდება და დარჩება მხოლოდ b.)
    // a = b

    printf("After:\n");
    // ვბეჭდავთ "After:", რასაც მოყვება შემდეგში ახალი ხაზი

    printf("a=%d\n", a);
    // ბეჭდავს a ცვლადის მნიშნველობას მონაცემების გაცვლის შემდეგ

    printf("b=%d\n", b);
    // ბეჭდავს b ცვლადის მნიშნველობას მონაცემების გაცვლის შემდეგ

    return 0;
    // ასრულებს ფუნქციას და აბრუნებს 0, რაც ნიშნავს, რომ ფუნქცია წარმატებით გაეშვა.
}