#include <stdio.h>
// აიმპორტებს ინპუთ/აუთპუთ ბიბლიოთეკას, რისი მეშვეობითაც გამოვიყენებთ ფუნქციებს - printf and scanf.

// პირობა: შეადგინეთ პროგრამა, რომელიც მთელი ტიპის დადებით სამნიშნა მნიშვნელობის ნებისმიერ ცვლადში გამოთვლის მის ციფრთა ჯამს.

int main()
// main (მთავარ) ფუნქციას განვსაზღვრავთ (ვქმნით)

{
    int x;
    //  დავადეკლარირეთ (შევქმენით) ერთი ცვლადი - x, სადაც შევინახავთ მომხმარებლის მიერ შემოყვანილ მნიშვნელობას. x ცვლადის ტიპია - int (ინტეჯერი, integer)

    printf("x=");
    // ვბეჭდავთ "x=:", რადგან მომხმარებელს მიანიშნოს, რომ x ცვლადისთვის შეიყვანოს მნიშვნელობა

    scanf("%d", &x);
    // კითხულობს მომხმარებლის მიერ შემოტანილ მნიშვნელობას და ინახავს x ცვლადში.
    // "%d" scanf ფუნქციას ეუბნება, რომ მნიშნველობა, რაც მომხმარებელმა შეიყვანა, int (ინტეჯერის) ტიპის უნდა იყოს (მაგ: 1, 2, 3, 4, 5....)
    // "&x" წარმოადგენს მეხსიერების მისამართს, სადაც scanf ფუნქცია შეინახავს მომხმარებლის მიერ შეყვანილ მნიშნველობას (მონაცემს)

    x = x / 100 + x / 10 % 10 + x % 10;
    // x / 100 => მთელ რიცხვს ვყოფთ 100-ზე. თუ x = 123, x / 100 => 1,23 => (დააბრუნებს 1, რადგან  რადგან x ინტეჯერია) => 1
    // x / 10 % 10 => x = 123; x / 10 => 12,3 (აქ აბრუნებს 12, რადგან x ინტეჯერია ) => 12 % 10 = 2;
    // x % 10 => x = 123 => 123 % 10 => 3
    // 1+2+3 = 5

    printf("sum=%d\n", x);
    // ბეჭდავს საბოლოო რეზულტატს

    return 0;
    // ასრულებს ფუნქციას და აბრუნებს 0, რაც ნიშნავს, რომ ფუნქცია წარმატებით გაეშვა.
}